//
//
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).


let time = +prompt('Введіть число від 0 до 59');

if (time <= 15) {
    console.log(' Перша  чверть години')
} else if (time <= 30) {

    console.log(' Друга чверть години')
} else if (time <= 45) {

    console.log(' Третя чверть години')
} else if (time <= 59) {

    console.log('Четверта чверть години')
}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити,
//     у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = +prompt('Ведіть число від 1 до 31');

if (day <= 10) {
    console.log('Перша декада місяця');
} else if (day <= 20) {
    console.log('Друга декада місяця');
} else (day <= 31)
    {
        console.log('Третя декада місяця');
    }

// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false.
//     Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = prompt('Зимой і влітку одним кольором?');
if (test==='ялинка') {
    console.log('Вірно!')
}
else {
    console.log('Невірно(')
}



let test=('ялинка');
let answer=test==='ялинка'?'Вірно':'Невірно(';
console.log(answer);


let test=('ялинка');
let answer=test==='ялинка'?'Вірно': test==='смерека'?'Вірно':'Невірно(';
console.log(answer);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть число');
if (a > 0) {
    console.log('Вірно!')
} else (a === 0)
{
    console.log('Невірно')
}

// - Скласти розклад на тиждень за домопоги switch.
//     Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

let key = '7';
switch (key) {
    case '1':
        console.log('понеділок: 16.00 фітнес');
        break;

    case'2':
        console.log('вівторок: 18.00 практика по програмуванню');
        break;

    case'3':
        console.log('середа -- 16.00  відвідування басейну');
        break;

    case'4':
        console.log('четвер-- 18.00 час вчитися Java Script');
        break;

    case'5':
        console.log('пятниця -- 16.00 зустріч з друзями');
        break;

    case'6':
        console.log('субота-- 11.30 заняття з англійської');
        break;

    case'7':
        console.log('неділя -- з 10.00 до 23.00 вчуся програмуванню ');
        break;

}
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.


    let year = +prompt(' Enter year ');
    let number = year % 4;
        if (number===0) {
        console.log('leap year')
    }
        else {
    console.log('Ordinary year')
    }
//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let name=prompt('Яка офіційна назва JavaScript?');
if(name==='ECMAScrspt'){
    console.log('Правильно!')
}
else {
    console.log('Не знаєте ? ECMAScript!')
}